CSI API ETABS v1
cPropFrame.GetTypeOAPI Method
 Retrieves the property type for the specified frame section property.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTypeOAPI(
	string Name,
	ref eFramePropType PropType
)
Function GetTypeOAPI (
	Name As String,
	ByRef PropType As eFramePropType
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim PropType As eFramePropType
Dim returnValue As Integer
returnValue = instance.GetTypeOAPI(Name,
	PropType)
int GetTypeOAPI(
	String^ Name,
	eFramePropType% PropType
)
abstract GetTypeOAPI :
        Name : string *
        PropType : eFramePropType byref -> int
Parameters
Name
Type: System.String
 The name of an existing frame section property.
PropType
Type: ETABSv1.eFramePropType
 This is one of the items in the eFramePropType enumeration.
Return Value
Type: Int32
 Returns zero if the type is successfully retrieved; otherwise it returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim PropType As eFramePropType
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get frame property type
       ret = SapModel.PropFrame.GetTypeOAPI("FSEC1", PropType)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace